multiple_select/app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "last_name", "user_name", "password", "first_name") VALUES('2011-07-05 02:20:35', '2011-07-05 02:20:35', 'last1', 'user1', 'pass1', 'first1')