grouped_collection_select/app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT * FROM "cities"

  def show
    @city = City.find(params[:id])
---
SELECT * FROM "cities" WHERE ("cities"."id" = 1)

  def edit
    @city = City.find(params[:id])
---
SELECT * FROM "cities" WHERE ("cities"."id" = 1)

  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("name", "created_at", "updated_at", "country_id") VALUES('citi1', '2011-07-04 12:38:37', '2011-07-04 12:38:37', 1)

  def update
    @city = City.find(params[:id])

    respond_to do |format|
      if @city.update_attributes(params[:city])
---
SELECT * FROM "cities" WHERE ("cities"."id" = 1)
UPDATE "cities" SET "updated_at" = '2011-07-04 12:43:39', "country_id" = 2 WHERE "id" = 1