grouped_collection_select/app/controllers/continents_controller.rb

SELECT * FROM "continents"
---
  def index
    @continents = Continent.all

SELECT * FROM "continents" WHERE ("continents"."id" = 1)
---
  def show
    @continent = Continent.find(params[:id])

SELECT * FROM "continents" WHERE ("continents"."id" = 1)
---
  def edit
    @continent = Continent.find(params[:id])

INSERT INTO "continents" ("created_at", "continent_name", "updated_at") VALUES('2011-07-04 13:15:16', 'con1', '2011-07-04 13:15:16')
---
  def create
    @continent = Continent.new(params[:continent])

    respond_to do |format|
      if @continent.save