auto_complete_test2/app/controllers/category_controller.rb

SELECT * FROM "categories" WHERE (name LIKE '%%')
---
  def index
    @categories = Category.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])