auto_complete_test2/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "created_at", "updated_at", "category_id") VALUES('prod1', '2011-06-27 07:23:33', '2011-06-27 07:23:33', 2)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2011-06-27 09:50:46', "category_id" = 5 WHERE "id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])