reCAPTCHA/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "password") VALUES('2011-06-28 07:01:01', '2011-06-28 07:01:01', 'user1', 'pass1')
---
  def create
    @user = User.new(params[:user])


    respond_to do |format|
      if validate_recap(params, @user.errors) && @user.save